In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import datetime as dt

In [3]:
folder = 'D:/Data_Analyst_Projet/Projet 8/Donnée debut projet/DAN-P8-donnees/donnees_python/'
folder_export = 'D:/Data_Analyst_Projet/Projet 8/Tableau/Fichiers csv nettoyes/'
folder_export_excel = 'D:/Data_Analyst_Projet/Projet 8/Donnée debut projet/DAN-P8-donnees\excel/'

In [4]:
# affichage des nombres et décimales
pd.options.display.float_format = '{:,.2f}'.format
pd.set_option('display.max_row', 200)
sns.set_theme(style="white", palette='YlOrRd')

## Import des fichiers

In [5]:
population=pd.read_csv(folder+'Population.csv')
continent=pd.read_csv(folder+'RegionCountry.csv')
political_stability=pd.read_csv(folder+'PoliticalStability.csv')
mortality_water=pd.read_csv(folder+'MortalityRateAttributedToWater.csv')
water_service=pd.read_csv(folder+'BasicAndSafelyManagedDrinkingWaterServices.csv')

## Population

In [6]:
# on enlève les lignes China car cela correspond au total des autres chine (continental, taiwan, HK...)
population.drop(population[population['Country']=='China'].index, inplace=True)

In [ ]:
population.loc[continent['Country']=='China, mainland', 'Country'] = 'China'

In [7]:
# population multipliée par 1000, on a la vraie population
population['Population'] = (population['Population']*1000).astype('int64')

#### Division population en 3 fichiers : Total, Genre et Zone

In [8]:
# création df population totale pays par année
population_total_pays = population[population['Granularity']=='Total'].drop(columns='Granularity').reset_index(drop=True)

In [9]:
# création df population pays par genre par année
population_genre = population[(population['Granularity']=='Male')|(population['Granularity']=='Female')].reset_index(drop=True)

# Renommage Granularity
population_genre.rename(columns={'Granularity' : 'Genre'}, inplace=True)

In [10]:
# création df population pays par zone par année
population_zone = population[(population['Granularity']=='Rural')|(population['Granularity']=='Urban')].reset_index(drop=True)

# Renommage Granularity
population_zone.rename(columns={'Granularity' : 'Zone'}, inplace=True)

## Continent

In [11]:
# renommage des colonnes
continent.rename(columns={'COUNTRY (DISPLAY)':'Country', 'REGION (DISPLAY)':'Continent'}, inplace=True)

In [12]:
# remplacement 'China' par 'China, mainland'
#continent.loc[continent['Country']=='China', 'Country'] = 'China, mainland'

In [13]:
# remplacement 'Republic of North Macedonia' par 'North Macedonia'
continent.loc[continent['Country']=='Republic of North Macedonia', 'Country'] = 'North Macedonia'

## Political Stability

In [14]:
political_stability.drop(columns='Granularity', inplace=True)

In [36]:
political_stability.loc[political_stability['Country']=='China, mainland', 'Country'] = 'China'

## MortalityRateAttributedToWater

In [15]:
# remplacement 'China' par 'China, mainland'
#mortality_water.loc[mortality_water['Country']=='China', 'Country'] = 'China, mainland'

In [16]:
# remplacement 'Republic of North Macedonia' par 'North Macedonia'
mortality_water.loc[mortality_water['Country']=='Republic of North Macedonia', 'Country'] = 'North Macedonia'

In [17]:
mortality_water.head()

,Year,Country,Granularity,Mortality rate attributed to exposure to unsafe WASH services,WASH deaths
0,2016,Afghanistan,Female,15.31,NaN
1,2016,Afghanistan,Male,12.61,NaN
2,2016,Afghanistan,Total,13.92,"4,824.35"
3,2016,Albania,Female,0.13,NaN
4,2016,Albania,Male,0.21,NaN

#### Division mortality_water en 2 fichiers : Total et Genre

In [18]:
# création df population totale pays par année
mortality_water_total_pays = mortality_water[mortality_water['Granularity']=='Total'].drop(columns='Granularity').reset_index(drop=True)

# création df population pays par genre par année
mortality_water_genre = mortality_water[(mortality_water['Granularity']=='Male')|(mortality_water['Granularity']=='Female')].reset_index(drop=True)

# Renommage Granularity
mortality_water_genre.rename(columns={'Granularity' : 'Genre'}, inplace=True)
# Suppression colonne 'WASH deaths'
mortality_water_genre.drop(columns='WASH deaths', inplace=True)

## BasicAndSafelyManagedDrinkingWaterServices

In [19]:
# remplacement 'China' par 'China, mainland'
#water_service.loc[water_service['Country']=='China', 'Country'] = 'China, mainland'

In [20]:
# remplacement 'Republic of North Macedonia' par 'North Macedonia'
water_service.loc[water_service['Country']=='Republic of North Macedonia', 'Country'] = 'North Macedonia'

#### Division water_service en 2 fichiers : Total et Zone

In [21]:
# création df population totale pays par année
water_service_total_pays = water_service[water_service['Granularity']=='Total'].drop(columns='Granularity').reset_index(drop=True)

# création df population pays par zone par année
water_service_zone = water_service[(water_service['Granularity']=='Rural')|(water_service['Granularity']=='Urban')].reset_index(drop=True)

# Renommage Granularity
water_service_zone.rename(columns={'Granularity' : 'Zone'}, inplace=True)

## Synthèse fichiers

In [22]:
political_stability.head()

       Country  Year  Political_Stability
0  Afghanistan  2000                -2.44
1  Afghanistan  2002                -2.04
2  Afghanistan  2003                -2.20
3  Afghanistan  2004                -2.30
4  Afghanistan  2005                -2.07

In [23]:
continent.head()

         Continent    Country
0           Europe    Albania
1           Europe    Andorra
2           Europe    Armenia
3  Western Pacific  Australia
4           Europe    Austria

In [24]:
population_total_pays

          Country  Year  Population
0     Afghanistan  2000    20779953
1     Afghanistan  2001    21606988
2     Afghanistan  2002    22600770
3     Afghanistan  2003    23680871
4     Afghanistan  2004    24726684
...           ...   ...         ...
4406     Zimbabwe  2014    13586707
4407     Zimbabwe  2015    13814629
4408     Zimbabwe  2016    14030331
4409     Zimbabwe  2017    14236595
4410     Zimbabwe  2018    14438802

[4411 rows x 3 columns]

In [25]:
population_genre.head()

       Country   Genre  Year  Population
0  Afghanistan    Male  2000    10689508
1  Afghanistan  Female  2000    10090449
2  Afghanistan    Male  2001    11117754
3  Afghanistan  Female  2001    10489238
4  Afghanistan    Male  2002    11642106

In [34]:
population_genre.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7618 entries, 0 to 7617
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     7618 non-null   object
 1   Genre       7618 non-null   object
 2   Year        7618 non-null   int64
 3   Population  7618 non-null   int64
dtypes: int64(2), object(2)
memory usage: 238.2+ KB

In [26]:
population_zone.head()

       Country   Zone  Year  Population
0  Afghanistan  Rural  2000    15657474
1  Afghanistan  Urban  2000     4436282
2  Afghanistan  Rural  2001    16318324
3  Afghanistan  Urban  2001     4648139
4  Afghanistan  Rural  2002    17086910

In [35]:
population_zone.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8790 entries, 0 to 8789
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     8790 non-null   object
 1   Zone        8790 non-null   object
 2   Year        8790 non-null   int64
 3   Population  8790 non-null   int64
dtypes: int64(2), object(2)
memory usage: 274.8+ KB

In [27]:
mortality_water_total_pays.head()

,Year,Country,Mortality rate attributed to exposure to unsafe WASH services,WASH deaths
0,2016,Afghanistan,13.92,"4,824.35"
1,2016,Albania,0.17,4.87
2,2016,Algeria,1.87,758.21
3,2016,Angola,48.81,"14,065.20"
4,2016,Antigua and Barbuda,0.11,0.12

In [28]:
mortality_water_genre.head()

,Year,Country,Genre,Mortality rate attributed to exposure to unsafe WASH services
0,2016,Afghanistan,Female,15.31
1,2016,Afghanistan,Male,12.61
2,2016,Albania,Female,0.13
3,2016,Albania,Male,0.21
4,2016,Algeria,Female,2.20

In [29]:
water_service_total_pays.head()

,Year,Country,Population using at least basic drinking-water services (%),Population using safely managed drinking-water services (%)
0,2000,Afghanistan,27.77,NaN
1,2000,Albania,87.87,49.29
2,2000,Algeria,89.84,NaN
3,2000,Andorra,100.00,90.64
4,2000,Angola,41.14,NaN

In [30]:
water_service_zone.head()

,Year,Country,Zone,Population using at least basic drinking-water services (%),Population using safely managed drinking-water services (%)
0,2000,Afghanistan,Rural,21.62,NaN
1,2000,Afghanistan,Urban,49.49,NaN
2,2000,Albania,Rural,81.78,NaN
3,2000,Albania,Urban,96.36,NaN
4,2000,Algeria,Rural,83.32,NaN

### Export fichiers non divisés vers excel

In [31]:
continent.to_excel(folder_export_excel+'continent.xlsx', index=False)
political_stability.to_excel(folder_export_excel+'political_stability.xlsx', index=False)
population.to_excel(folder_export_excel+'population.xlsx', index=False)
mortality_water.to_excel(folder_export_excel+'mortality_water.xlsx', index=False)
water_service.to_excel(folder_export_excel+'water_service.xlsx', index=False)

## Export

In [32]:
population_total_pays.to_csv(folder_export+'population_total_pays.csv', index=False)
population_genre.to_csv(folder_export+'population_genre.csv', index=False)
population_zone.to_csv(folder_export+'population_zone.csv', index=False)

continent.to_csv(folder_export+'continent.csv', index=False)

mortality_water_total_pays.to_csv(folder_export+'mortality_water_total_pays.csv', index=False)
mortality_water_genre.to_csv(folder_export+'mortality_water_genre.csv', index=False)

water_service_total_pays.to_csv(folder_export+'water_service_total_pays.csv', index=False)
water_service_zone.to_csv(folder_export+'water_service_zone.csv', index=False)

political_stability.to_csv(folder_export+'political_stability.csv', index=False)

In [33]:
population.to_csv(folder_export+'population.csv', index=False)
mortality_water.to_csv(folder_export+'mortality_water.csv', index=False)
water_service.to_csv(folder_export+'water_service.csv', index=False)